'use client'
import { FC } from 'react'
import React, { useEffect, useRef, useState } from 'react'
import { motion } from 'framer-motion'
import Ilness from './Ilness'
import Card from '../Card'
import { BackgroundBeamsWithCollision } from '../BackgroundBeamsWithCollision'

export const diseases = [
  {
    id: 1,
    title: 'مراقبت‌های پیش از بارداری',
    description:
      'مراقبت های دوران بارداری محدود به طول زمان بارداری نیست بلکه نیاز است خانم هایی که قصد باردار شدن دارند از سه ماه پیش از اقدام تحت نظر پزشک باشد تا آزمایش های لازم ، معاینات و در صورت نیاز پاپ اسمیر و ماموگرافی برای ایشان انجام شود و از لحاظ سایر بیماری های داخلی نیز مورد بررسی قرار بگیرند  تا در صورت وجود هر مشکل پیش از باردار شدن جهت رفع یا کنترل آن اقدام شود.',
  },
  {
    id: 2,
    title: 'مراقبت‌های طول بارداری',
    description:
      'در طول مدت بارداری نیاز است طبق برنامه کشوری خانم های باردار در فواصل معین مورد معاینه قرار بگیرند و از نظر مشکلات،  آزمایش ها و سونوگرافی ارزیابی شوند   و به پرسش های احتمالی ایشان پاسخ داده شود. همینطور در این مدت نیاز است از نظر تغییرات وزن ، فشار خون و تخمین اندازه جنین تحت نظر باشند تا در صورت وجود اختلال در هر یک از این موارد اقدامات لازم انجام شود تا کمترین آسیب مادری و جنینی اتفاق بیفتد.',
  },
  {
    id: 3,
    title: 'مراقبت‌های پس از زایمان',
    description:
      'تا ۴۲ روز یعنی ۶ هفته پس از زایمان نیز لازم است خانم های باردار با متخصص زنان در ارتباط باشد ، چون مشکلات داخلی یا جراحی ایجاد شده برای ایشان در این مدت ممکن است ریشه دوران بارداری داشته باشد و نیازمند مداخلات خاص باشد . برای مثال لخته شدن خون در وریدهای ساق اندام تحتانی مشکلی است که احتمال بروز آن در ۶ هفته پس از زایمان افزایش می یابد.',
  },
  {
    id: 4,
    title: 'سرکلاژ',
    description:
      'یک عمل جراحی است که به معنای دوختن گرداگرد گردن رحم می باشد . این جراحی در تعداد معدودی از خانم های باردار که دارای مشکلاتی در ساختمان یا طول گردن رحم می باشد جهت پیشگیری از زایمان زودرس در نیمه اول بارداری انجام میشود.',
  },
  {
    id: 5,
    title: 'عفونت‌ها',
    description:
      'عفونت ها یکی از شایع‌ترین دلایل مراجعه خانم ها به مطب متخصصان زنان می باشد. این عفونت ها در هر ناحیه ای می تواند ایجاد شود واژن ، سرویکس  یا گردن رحم، رحم و لگن توانند نواحی درگیر عفونت‌ها باشد  که هرکدام درمانهای مخصوص به خود را دارد.  تشخیص به وسیله شرح حال ، معاینه ، آزمایش و سونوگرافی است.',
  },
  {
    id: 6,
    title: 'خونریزیهای غیرطبیعی رحم',
    description:
      'طول مدت سیکل قاعدگی ۲۳ تا ۳۸ روز و طول مدت خونریزی ۷ تا ۸ روز طبیعی است. هر نوع تغییر سیکل های قاعدگی از این روند یا افزایش بیش از حد معمول خونریزی نیازمند بررسی و گاهی درمان است. از آنجایی که خونریزی های غیرطبیعی رحم می تواند ریشه در مشکلات داخلی مثل برخی مشکلات هورمونی یا سرطان های زنان داشته باشند اغلب لازم است پیش از هر اقدام شرح حال ، معاینه ، آزمایش هورمونی و سونوگرافی انجام شود .',
  },
  {
    id: 7,
    title: 'بیوپسی اندومتر یا نمونه‌برداری آندومتر',
    description:
      'یک روش بسیار عالی برای تشخیص سرطان های جسم رحم می باشد . این کار بسته به شرایط بیمار به دو صورت انجام می شود : ۱ -روش سرپایی یا پایپل در این روش به وسیله لوازم مخصوص ، در مطب و بدون نیاز به بیهوشی از بافت رحم نمونه برداری میشود ۲- روش کودتاژ تشخیصی در اتاق عمل : این روش در بیمارستان و تحت بیهوشی امکانپذیر است.  سپس نمونه بافتی به دست آمده جهت بررسی بافت شناسی ( پاتولوژی ) به آزمایشگاه ارسال می شود و درمان بر اساس نتایج بررسی بافت شناسی انجام می گیرد.',
  },
  {
    id: 8,
    title: 'پاپ اسمیر',
    description:
      'بهترین روش برای تشخیص زودرس سرطان های گردن رحم می باشد. در این روش به صورت سرپایی مقداری از بافت گردن رحم جهت بررسی پاتولوژی تراشیده می شود. اگر همراه با بررسی پاتولوژی ، این نمونه از نظر ویروس زگیل یا پاپیلوما نیز مورد بررسی قرار بگیرد دقت تشخیصی بسیار بالاتر خواهد بود. امروزه روش ارجح بررسی همزمان بافت‌شناسی و ویروسی است.',
  },
]
export const womanBeuties = [
  {
    id: 1,
    title: 'لبیاپلاستی',
    description:
      'لبیا مینور یک چین پوستی حاوی گیرنده‌های عصبی حسی زیادی است که از کلیتوریس به اطراف دهانه واژن کشیده میشود. مهمترین عامل بزرگ بودن لابیاها عوامل ارثی است و  افزایش سن، زایمانای مکرر و کاهش وزن شدید نیز می‌تواند در آن موثر باشد. بزرگ شدن لبیاها علاوه بر اینکه باعث عدم تقارن آنها شده و از نظر زیبایی ممکن است مشکل ساز باشد، ممکن است باعث مشکلاتی از قبیل اختلال در عملکرد جنسی یا عفونت های مکرر می شود که نتیجه آن در بسیاری از موارد کاهش اعتماد به نفس و اختلال در روابط زناشویی است. با عمل لبیاپلاستی بخش های اضافه به روش جراحی برداشته می شوند.',
  },
  {
    id: 2,
    title: 'شرایط عمل لیباپلاستی',
    description:
      'این جراحی بدون نیاز به بیهوشی و با بی‌حسی موضعی انجام می‌شود و حدود 45 دقیقه طول می‌کشد.  بسته به شرایط بیمار و با تصمیم پزشک، برش به وسیله تیغ جراحی، لیزر یا RF انجام می‌شود. در روش استفاده از لیزر و آر اف برای برش، به دلیل آن که امکان انعقاد همزمان نیز وجود دارد احتمال خونریزی بسیار کم است. پس از اتمام جراحی بدون نیاز به بستری بیمار مرخص می شود. با توجه به این که در صورت انجام صحیح این جراحی به کلیتوریس آسیبی وارد نمی‌شود به هیچ عنوان باعث کاهش حس و تمایل جنسی نمی‌شود.',
  },
  {
    id: 3,
    title: 'واژینوپلاستی',
    description:
      'پس از بارداری و زایمان به دلیل کشش های ایجاد شده در واژن ، این بافت قوام و استحکام خود را از دست میدهد لذا بسیاری از خانم ها بعد از زایمان باعث مشکلاتی از قبیل اشکال در روابط جنسی ، احساس دفع گاز از واژن و کاهش اعتماد به نفس می شوند . بوسیله واژینوپلاستی بافت واژن ترمیم می شود و این مشکلات بصورت دائم از بین پی روند. ',
  },
  {
    id: 4,
    title: 'شرایط عمل واژینوپلاستی',
    description:
      'واژینوپلاستی بصورت سرپایی و بدون بیهوشی و تنها با بی حسی موضعی انجام می شود. این جراحی بوسیله دستگاه RF و بدون خونریزی قابل توجه است و شخص بلافاصله پس از اتمام جراحی مرخص می شود.',
  },
]

export const publicBeuties = [
  {
    id: 1,
    title: 'تزریق ژل',
    description:
      'ژل از جنس هیالورونیک اسید است و جهت پر کردن فضاهای خالی زیر پوست و حجم دهی استفاده می شود.',
  },
  {
    id: 2,
    title: 'تزریق بوتاکس',
    description:
      'این روش جهت جوانسازی و رفع چروک های پوستی استفاده می شود. همین طور در کنار روان درمانی و سکس تراپی روشی عالی جهت بهبود واژینیسموس است.',
  },
  {
    id: 3,
    title: 'بلفاروپلاستی',
    description:
      'افتادگی پلک یکی از مشکلاتی است که با افزایش سن باعث اختلال در نگاه به مقابل و بالا می شود و از نظر زیبایی نیست برای بسیاری از افراد آزار دهنده است. برداشتن پوست اضافه روی پلک بوسیله دستگاه RF بدون خونریزی انجام میشود. این اقدام بصورت سرپایی و بدون نیاز به بیهوشی انجام و شخص بلافاصله پس از اتمام جراحی مرخص می شود.',
  },
  {
    id: 4,
    title: 'پلاسماتراپی',
    description:
      'تا ۴۲ روز یعنی ۶ هفته پس از زایمان نیز لازم است خانم های باردار با متخصص زنان در ارتباط باشد ، چون مشکلات داخلی یا جراحی ایجاد شده برای ایشان در این مدت ممکن است ریشه دوران بارداری داشته باشد و نیازمند مداخلات خاص باشد . برای مثال لخته شدن خون در وریدهای ساق اندام تحتانی مشکلی است که احتمال بروز آن در ۶ هفته پس از زایمان افزایش می یابد.',
  },
  {
    id: 5,
    title: 'کربوکسی تراپی',
    description:
      'این روش در بهبود زخم ، عفونت های مزمن و تکرار شونده واژن و رفع استریای بارداری ( ترک های پوستی ) موثر است.',
  },
]
interface DiseasesProps {}

const Diseases: FC<DiseasesProps> = ({}) => {
  const [width, setWidth] = useState(0)
  const carousel = useRef<HTMLElement>(null)
  useEffect(() => {
    setWidth(carousel!.current!.scrollWidth - carousel!.current!.offsetWidth)
  }, [])
  return (
    <motion.section
      ref={carousel}
      className={`overflow-x-hidden my-16 ${`services`} ${`carousel`}`}
    >
      {/* <Particle  /> */}
      <div className={`${`center`}`}>
        <article className={`title `}>
          <h2 className="mb-28">خدمات </h2>
        </article>
        <div className={`flex flex-col text-sm font-farsi justify-between `}>
          <h3 className="font-bold text-[var(--clr-neon3)] text-lg my-8 mr-2 md:mr-4">
            زنان و زایمان
          </h3>

          <motion.article
            drag="x"
            dragConstraints={{ left: 0, right: width }}
            whileTap={{ cursor: 'grabbing' }}
            className={`innerCrousel flex cursor-grab -mx-4 `}
          >
            {diseases.map((ilness) => (
              <Card
                key={ilness.id}
                // className={`service min-h-[40rem] w-[45rem] `}
                title={ilness.title}
                content={ilness.description}
                color="[var(--clr-neon3)]"
              />
            ))}
          </motion.article>

          <div className={`flex flex-col text-sm font-farsi justify-between `}>
            <h3 className="font-bold text-[var(--clr-neon1)] text-lg my-8 mr-2 md:mr-4">
              زیبایی عمومی
            </h3>
            <motion.article
              drag="x"
              dragConstraints={{ left: 0, right: width }}
              whileTap={{ cursor: 'grabbing' }}
              className={`innerCrousel flex cursor-grab -mx-4 `}
            >
              {publicBeuties.map((ilness) => (
                <Card
                  key={ilness.id}
                  // className={`service min-h-[40rem] w-[45rem] `}
                  title={ilness.title}
                  content={ilness.description}
                  color="[var(--clr-neon1)]"
                />
              ))}
            </motion.article>
          </div>
          <div className={`flex flex-col text-sm font-farsi justify-between `}>
            <h3 className="font-bold text-[var(--clr-neon)] text-lg my-8 mr-2 md:mr-4">
              جراحی‌های زیبایی زنان
            </h3>
            <motion.article
              drag="x"
              dragConstraints={{ left: 0, right: width }}
              whileTap={{ cursor: 'grabbing' }}
              className={`innerCrousel flex cursor-grab -mx-4 `}
            >
              {womanBeuties.map((ilness) => (
                <Card
                  key={ilness.id}
                  // className={`service min-h-[40rem] w-[45rem] `}
                  title={ilness.title}
                  content={ilness.description}
                  color="[var(--clr-neon)]"
                />
              ))}
            </motion.article>
          </div>
        </div>
      </div>
    </motion.section>
  )
}

export default Diseases
